# Data Loading and Inspection

In [4]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [10]:
df.shape

(891, 12)

In [11]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [12]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# Data Cleaning

In [18]:
df.loc[:, 'Age'] = df['Age'].fillna(df['Age'].median())
df.loc[:, 'Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
df.loc[:, 'Cabin'] = df['Cabin'].fillna('Unknown')

In [19]:
df.drop_duplicates(inplace=True)

In [20]:
df['Sex'] = df['Sex'].astype('category')
df['Embarked'] = df['Embarked'].astype('category')

In [21]:
df.rename(columns={'Fare': 'Ticket_Price', 'Embarked': 'Embarkation_Town'}, inplace=True)

In [22]:
df.drop(columns=[ 'Ticket'], inplace=True)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   PassengerId       891 non-null    int64
 1   Survived          891 non-null    int64
 2   Pclass            891 non-null    int64
 3   Name              891 non-null    object
 4   Sex               891 non-null    category
 5   Age               891 non-null    float64
 6   SibSp             891 non-null    int64
 7   Parch             891 non-null    int64
 8   Ticket_Price      891 non-null    float64
 9   Cabin             891 non-null    object
 10  Embarkation_Town  891 non-null    category
dtypes: category(2), float64(2), int64(5), object(2)
memory usage: 64.8+ KB

# Data Transformation

In [24]:
df['Family_Size'] = df['SibSp'] + df['Parch'] + 1

In [25]:
high_fare_df = df[df['Ticket_Price'] > 50]

In [26]:
df.sort_values(by='Age', ascending=False, inplace=True)

In [27]:
sex_grouped = df.groupby('Sex').agg({'Age': ['mean', 'median'], 'Ticket_Price': ['mean', 'sum'], 'PassengerId': 'count'})

C:\Users\ramzy\AppData\Local\Temp\ipykernel_9428\1520037128.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sex_grouped = df.groupby('Sex').agg({'Age': ['mean', 'median'], 'Ticket_Price': ['mean', 'sum'], 'PassengerId': 'count'})

In [28]:
sex_grouped

              Age        Ticket_Price             PassengerId
             mean median         mean         sum       count
Sex
female  27.929936   28.0    44.479818  13966.6628         314
male    30.140676   28.0    25.523893  14727.2865         577

In [29]:
def age_category(age):
    if age < 18:
        return 'Child'
    elif age < 60:
        return 'Adult'
    else:
        return 'Senior'

df['Age_Group'] = df['Age'].apply(age_category)

# Data Aggregation

In [30]:
summary_stats = df.describe()

In [31]:
class_grouped = df.groupby('Pclass').agg({'Ticket_Price': ['sum', 'mean'], 'Age': ['mean', 'median']})

In [32]:
titanic_pivot = df.pivot_table(values='Survived', index='Pclass', columns='Sex', aggfunc='mean')

C:\Users\ramzy\AppData\Local\Temp\ipykernel_9428\748988857.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic_pivot = df.pivot_table(values='Survived', index='Pclass', columns='Sex', aggfunc='mean')

In [33]:
embark_crosstab = pd.crosstab(df['Embarkation_Town'], df['Pclass'])

In [34]:
summary_stats

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Ticket_Price,Family_Size
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.361582,0.523008,0.381594,32.204208,1.904602
std,257.353842,0.486592,0.836071,13.019697,1.102743,0.806057,49.693429,1.613459
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,1.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400,1.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000,2.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,11.000000

In [35]:
class_grouped

       Ticket_Price                   Age
                sum       mean       mean median
Pclass
1        18177.4125  84.154687  36.812130   35.0
2         3801.8417  20.662183  29.765380   28.0
3         6714.6951  13.675550  25.932627   28.0

In [36]:
titanic_pivot

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447

In [37]:
embark_crosstab

Pclass              1    2    3
Embarkation_Town
C                  85   17   66
Q                   2    3   72
S                 129  164  353